package models

import (
	"errors"
	"fmt"
	_ "github.com/go-sql-driver/mysql"
	"github.com/jinzhu/gorm"
	"os"
)

var db *gorm.DB

func InitDB() {
	USER := os.Getenv("MYSQL_USER")
	PASS := os.Getenv("MYSQL_PASSWORD")
	PROTOCOL := "tcp(mysql_host:3306)"
	DBNAME := os.Getenv("MYSQL_DATABASE")

	var err error
	CONNECT := USER + ":" + PASS + "@" + PROTOCOL + "/" + DBNAME + "?charset=utf8&parseTime=True&loc=Local"

	fmt.Println("* Opening Mysql database...")
	db, err = gorm.Open("mysql", CONNECT)

	if err != nil {
		panic(err.Error())
	}

	fmt.Println("* Mysql database opened!!")
	db.LogMode(true)
	InitTables(db)
}

func TruncateTables(db2 *gorm.DB) {
	rows, err := db2.Raw("show tables").Rows()
	if err != nil {
		panic(err.Error())
	}
	defer rows.Close()
	for rows.Next() {
		var table string
		if err := rows.Scan(&table); err != nil {
			panic(err.Error())
		}
		db.Exec("TRUNCATE TABLE " + table)
	}
}

func InitTables(db2 *gorm.DB) {
	tx := db2.Begin()
	TruncateTables(tx)
	tx.Exec("INSERT INTO `Dishes` (`id`, `created_at`, `updated_at`, `deleted_at`, `dish_name`, `store_name`)VALUES(1, '2019-09-04 04:35:05', '2019-09-04 04:35:41', NULL, '北極ラーメン', '蒙古タンメン中本'),(2, '2019-09-04 04:59:42', '2019-09-04 05:02:40', NULL, '野菜ラーメン(味噌)', '8番ラーメン'),(3, '2019-09-04 04:59:42', '2019-09-04 05:02:45', NULL, '野菜ラーメン(塩)', '8番ラーメン'),(4, '2019-09-04 04:59:42', '2019-09-04 05:03:19', NULL, '野菜ラーメン(醤油)', '8番ラーメン'),(5, '2019-09-04 04:59:42', '2019-09-04 05:03:21', NULL, '野菜ラーメン(豚骨)', '8番ラーメン'),(6, '2019-09-04 04:59:42', '2019-09-04 05:08:58', NULL, 'ラーメン(中)', 'ラーメン池田屋'),(7, '2019-09-04 04:59:42', '2019-09-04 06:02:09', NULL, 'ラーメン(大)', 'ラーメン池田屋'),(8, '2019-09-04 04:59:42', '2019-09-04 06:02:19', NULL, 'jigカレー', 'jig.jp'),(9, '2019-09-04 06:20:14', '2019-09-04 06:24:01', NULL, 'サバエドッグ', 'ミート&デリカささき'),(10, '2019-09-04 06:25:09', '2019-09-04 06:25:14', NULL, 'プレミアムおろしポン酢牛めし 並盛', '松屋'),(11, '2019-09-04 06:37:21', '2019-09-04 06:37:24', NULL, 'タコライス', 'JCH'),(12, '2019-09-04 06:45:05', '2019-09-04 06:45:24', NULL, '福井名物定食', '福福茶屋'),(13, '2019-09-04 06:53:15', '2019-09-04 06:53:18', NULL, 'SK', NULL),(14, '2019-09-04 06:57:34', '2019-09-04 06:57:47', NULL, 'チキンカレー', 'カレーの王様'),(15, '2019-09-04 06:58:52', '2019-09-04 06:59:11', NULL, 'サーモン3種', '海鮮アトム'),(16, '2019-09-04 07:00:56', '2019-09-04 07:01:06', NULL, 'チーズナンセット', 'ガンジー'),(17, '2019-09-04 07:02:32', '2019-09-04 07:02:43', NULL, '釜飯', '窯蔵'),(18, '2019-09-04 07:05:01', '2019-09-04 07:05:09', NULL, 'ポークカレー', 'LAND');")
	tx.Exec("INSERT INTO `Follows` (`id`, `user_id`, `follow_id`, `created_at`, `updated_at`)VALUES(1, 1, 1, '2019-08-23 08:47:14', '2019-08-23 08:47:14'),(2, 1, 3, '2019-08-23 08:47:20', '2019-08-23 08:47:20'),(4, 1, 2, '2019-08-26 01:41:21', '2019-08-26 01:41:21'),(11, 1, 3, '2019-08-26 06:45:38', '2019-08-26 06:45:38'),(12, 1, 3, '2019-08-26 07:04:41', '2019-08-26 07:04:41'),(13, 1, 3, '2019-08-26 07:06:27', '2019-08-26 07:06:27'),(14, 1, 3, '2019-08-26 07:29:35', '2019-08-26 07:29:35'),(15, 1, 3, '2019-08-26 07:30:02', '2019-08-26 07:30:02');")
	tx.Exec("INSERT INTO `Posts` (`id`, `user_id`, `created_at`, `updated_at`, `dish_id`, `comment`, `image_address`)VALUES(1, 2, '2019-09-04 04:34:22', '2019-09-04 06:54:29', 1, '辛さがちょうどよかった', '/uploads/pictures/20190904044406_ramen_top_tantanmen.png'),(2, 2, '2019-09-04 04:34:22', '2019-09-04 06:54:30', 2, '意外と量が多かった', '/uploads/pictures/20190904050718_IMG_7274.JPG'),(3, 2, '2019-09-04 04:34:22', '2019-09-04 06:54:32', 6, '二郎系ラーメン店にしてはそこまで味は濃くないので、二郎系入門にオススメ。ただ量は非常に多いので、気をつけるべし。', '/uploads/pictures/20190904051117_IMG_6416.jpg'),(4, 3, '2019-09-04 04:34:22', '2019-09-04 06:54:36', 6, 'これは太りそう。', NULL),(5, 5, '2019-09-04 04:34:22', '2019-09-04 06:25:47', 8, 'jig.jp限定jigカレー とにかくスピードが早い', '/uploads/pictures/20190904060142_IMG_7219.JPG'),(6, 2, '2019-09-04 04:34:22', '2019-09-04 06:25:49', 9, 'それなりにソースカツ丼の味がした', '/uploads/pictures/20190904062326_IMG_6269.jpg'),(7, 3, '2019-09-04 04:34:22', '2019-09-04 06:25:50', 9, '名称そのまま、歩くソースカツ丼！', '/uploads/pictures/20190904062326_IMG_6269.jpg'),(8, 4, '2019-09-04 04:34:22', '2019-09-04 06:25:52', 9, 'いい味してんねぇ！', '/uploads/pictures/20190904062326_IMG_6269.jpg'),(9, 5, '2019-09-04 04:34:22', '2019-09-04 06:25:54', 9, 'とても食べやすいですね', '/uploads/pictures/20190904062326_IMG_6269.jpg'),(10, 2, '2019-09-04 04:34:22', '2019-09-04 06:54:42', 10, 'さっぱりしてた', NULL),(11, 4, '2019-09-04 06:37:38', '2019-09-04 06:37:50', 11, '野菜もついてて美味しかったです。調理も簡単でした！', NULL),(12, 2, '2019-09-04 06:45:33', '2019-09-04 06:49:21', 12, '値段の割に量も多く、福井を堪能できる一品でした！', '/uploads/pictures/20190904064743_IMG_7394.jpg'),(13, 3, '2019-09-04 06:52:51', '2019-09-04 06:53:54', 13, '思ったより薄めの味付けで、とてもさっぱりしてました！もう一杯食べられそうです^^', '/uploads/pictures/20190904065348_sk.jpg'),(14, 1, '2019-09-04 06:57:07', '2019-09-04 06:58:05', 14, 'ちょうどいい辛さでとても美味しかったです！ナンも最高でした', '/uploads/pictures/20190904065658_curry.jpg'),(15, 1, '2019-09-04 06:58:34', '2019-09-04 07:01:24', 15, 'サーモン大好きっ子なので、最高でした 👍', '/uploads/pictures/20190904065937_salmon.jpg'),(16, 1, '2019-09-04 07:00:28', '2019-09-04 07:01:12', 16, 'チーズナンめちゃくちゃ美味しかった！！', '/uploads/pictures/20190904070020_curry2.jpg'),(17, 1, '2019-09-04 07:02:04', '2019-09-04 07:04:45', 17, '釜飯をあんまり食べたことがなかったのですが、ちょうどいい量で最高でした', '/uploads/pictures/20190904070156_meshi.jpg'),(18, 1, '2019-09-04 07:03:18', '2019-09-04 07:05:13', 18, 'スパイスがとても効いた少し辛めのカレーでした。開店30分前から大行列でしたが、並んだ甲斐ありました', '/uploads/pictures/20190904070308_pork.jpg');")
	tx.Exec("INSERT INTO `Users` (`id`, `name`, `created_at`, `updated_at`, `biography`, `birth`, `country`, `prefecture`, `icon_address`)VALUES(1, 'やまだ', '2019-09-04 04:44:38', '2019-09-04 06:31:22', 'jig.jp エンジニア', '1980-02-03', 'Japan', 'Fukui', NULL),(2, 'でみ', '2019-09-04 04:44:38', '2019-09-04 05:53:08', 'まいづるこーせん', '1980-02-03', 'Japan', 'Kyoto', NULL),(3, 'watano', '2019-09-04 04:44:38', '2019-09-04 05:50:45', 'いばらきこーせん', '1980-02-03', 'Japan', 'Ibaraki', NULL),(4, 'はたはた', '2019-09-04 04:44:38', '2019-09-04 05:53:20', 'つやまこーせん', '1980-02-03', 'Japan', 'Okayama', NULL),(5, '箒コウモリ', '2019-09-04 04:44:38', '2019-09-04 05:54:06', 'かがわこーせんたかまつきゃんぱす', '1980-02-03', 'Japan', 'Kagawa', NULL);")
	if tx.Error != nil {
		fmt.Println("\x1b[31mstarting transition failed.\x1b[0m")
		tx.Rollback()
		return
	}
	tx.Commit()
}

func GetDB() (*gorm.DB, error) {
	if db == nil {
		return nil, errors.New("database reference is null")
	}
	return db, nil
}

func Finalize() error {
	err := db.Close()
	return err
}
